type ScoreTableKo = {
    [fu: number]: {
        [han: number]: {
            ron: number;
            tsumo: [number, number];
        }
    }
};

type ScoreTableOya = {
    [fu: number]: {
        [han: number]: {
            ron: number;
            tsumo: number;
        }
    }
};

type ManganTableKo = {
    [han: number]: {
        ron: number;
        tsumo: [number, number];
    }
};

type ManganTableOya = {
    [han: number]: {
        ron: number;
        tsumo: number;
    }
}

export const scoreTableKo: ScoreTableKo = {
    "20": {
        "2": {
            "ron": 0, //存在しない
            "tsumo": [400, 700]
        },
        "3": {
            "ron": 0, //存在しない
            "tsumo": [700, 1300]
        },
        "4": {
            "ron": 0, //存在しない
            "tsumo": [1300, 2600]
        }
    },
    "25": {
        "2": {
            "ron": 1600,
            "tsumo": [0, 0] //存在しない
        },
        "3": {
            "ron": 3200,
            "tsumo": [800, 1600]
        },
        "4": {
            "ron": 6400,
            "tsumo": [1600, 3200]
        }
    },
    "30": {
        "1": {
            "ron": 1000,
            "tsumo": [300, 500]
        },
        "2": {
            "ron": 2000,
            "tsumo": [500, 1000]
        },
        "3": {
            "ron": 3900,
            "tsumo": [1000, 2000]
        },
        "4": {
            "ron": 7700,
            "tsumo": [2000, 3900]
        }
    },
    "40": {
        "1": {
            "ron": 1300,
            "tsumo": [400, 700]
        },
        "2": {
            "ron": 2600,
            "tsumo": [700, 1300]
        },
        "3": {
            "ron": 5200,
            "tsumo": [1300, 2600]
        },
        "4": {
            "ron": 8000,
            "tsumo": [2000, 4000]
        }
    },
    "50": {
        "1": {
            "ron": 1600,
            "tsumo": [400, 800]
        },
        "2": {
            "ron": 3200,
            "tsumo": [800, 1600]
        },
        "3": {
            "ron": 6400,
            "tsumo": [1600, 3200]
        },
        "4": {
            "ron": 8000,
            "tsumo": [2000, 4000]
        }
    },
    "60": {
        "1": {
            "ron": 2000,
            "tsumo": [500, 1000]
        },
        "2": {
            "ron": 3900,
            "tsumo": [1000, 2000]
        },
        "3": {
            "ron": 7700,
            "tsumo": [2000, 3900]
        },
        "4": {
            "ron": 8000,
            "tsumo": [2000, 4000]
        }
    },
    "70": {
        "1": {
            "ron": 2300,
            "tsumo": [600, 1200]
        },
        "2": {
            "ron": 4500,
            "tsumo": [1200, 2300]
        },
        "3": {
            "ron": 8000,
            "tsumo": [2000, 4000]
        },
        "4": {
            "ron": 8000,
            "tsumo": [2000, 4000]
        }
    },
    "80": {
        "1": {
            "ron": 2600,
            "tsumo": [700, 1300]
        },
        "2": {
            "ron": 5200,
            "tsumo": [1300, 2600]
        },
        "3": {
            "ron": 8000,
            "tsumo": [2000, 4000]
        },
        "4": {
            "ron": 8000,
            "tsumo": [2000, 4000]
        }
    },
    "90": {
        "1": {
            "ron": 2900,
            "tsumo": [800, 1500]
        },
        "2": {
            "ron": 5800,
            "tsumo": [1500, 2900]
        },
        "3": {
            "ron": 8000,
            "tsumo": [2000, 4000]
        },
        "4": {
            "ron": 8000,
            "tsumo": [2000, 4000]
        }
    },
    "100": {
        "1": {
            "ron": 3200,
            "tsumo": [800, 1600]
        },
        "2": {
            "ron": 6400,
            "tsumo": [1600, 3200]
        },
        "3": {
            "ron": 8000,
            "tsumo": [2000, 4000]
        },
        "4": {
            "ron": 8000,
            "tsumo": [2000, 4000]
        }
    },
    "110": {
        "1": {
            "ron": 3600,
            "tsumo": [0, 0] //存在しない
        },
        "2": {
            "ron": 7100,
            "tsumo": [1800, 3600]
        },
        "3": {
            "ron": 8000,
            "tsumo": [2000, 4000]
        },
        "4": {
            "ron": 8000,
            "tsumo": [2000, 4000]
        }
    }
};

export const scoreTableOya: ScoreTableOya = {
    "20": {
        "2": {
            "ron": 0, //存在しない
            "tsumo": 700
        },
        "3": {
            "ron": 0, //存在しない
            "tsumo": 1300
        },
        "4": {
            "ron": 0, //存在しない
            "tsumo": 2600
        }
    },
    "25": {
        "2": {
            "ron": 2400,
            "tsumo": 0 //存在しない
        },
        "3": {
            "ron": 4800,
            "tsumo": 1600
        },
        "4": {
            "ron": 9600,
            "tsumo": 3200
        }
    },
    "30": {
        "1": {
            "ron": 1500,
            "tsumo": 500
        },
        "2": {
            "ron": 2900,
            "tsumo": 1000
        },
        "3": {
            "ron": 5800,
            "tsumo": 2000
        },
        "4": {
            "ron": 11600,
            "tsumo": 3900
        }
    },
    "40": {
        "1": {
            "ron": 2000,
            "tsumo": 700
        },
        "2": {
            "ron": 3900,
            "tsumo": 1300
        },
        "3": {
            "ron": 7700,
            "tsumo": 2600
        },
        "4": {
            "ron": 12000,
            "tsumo": 4000
        }
    },
    "50": {
        "1": {
            "ron": 2400,
            "tsumo": 800
        },
        "2": {
            "ron": 4800,
            "tsumo": 1600
        },
        "3": {
            "ron": 9600,
            "tsumo": 3200
        },
        "4": {
            "ron": 12000,
            "tsumo": 4000
        }
    },
    "60": {
        "1": {
            "ron": 2900,
            "tsumo": 1000
        },
        "2": {
            "ron": 5800,
            "tsumo": 2000
        },
        "3": {
            "ron": 11600,
            "tsumo": 3900
        },
        "4": {
            "ron": 12000,
            "tsumo": 4000
        }
    },
    "70": {
        "1": {
            "ron": 3400,
            "tsumo": 1200
        },
        "2": {
            "ron": 6800,
            "tsumo": 2300
        },
        "3": {
            "ron": 12000,
            "tsumo": 4000
        },
        "4": {
            "ron": 12000,
            "tsumo": 4000
        }
    },
    "80": {
        "1": {
            "ron": 4900,
            "tsumo": 1300
        },
        "2": {
            "ron": 7700,
            "tsumo": 2600
        },
        "3": {
            "ron": 12000,
            "tsumo": 4000
        },
        "4": {
            "ron": 12000,
            "tsumo": 4000
        }
    },
    "90": {
        "1": {
            "ron": 4400,
            "tsumo": 1500
        },
        "2": {
            "ron": 8700,
            "tsumo": 2900
        },
        "3": {
            "ron": 12000,
            "tsumo": 4000
        },
        "4": {
            "ron": 12000,
            "tsumo": 4000
        }
    },
    "100": {
        "1": {
            "ron": 4800,
            "tsumo": 1600
        },
        "2": {
            "ron": 9600,
            "tsumo": 3200
        },
        "3": {
            "ron": 12000,
            "tsumo": 4000
        },
        "4": {
            "ron": 12000,
            "tsumo": 4000
        }
    },
    "110": {
        "1": {
            "ron": 5300,
            "tsumo": 0 //存在しない
        },
        "2": {
            "ron": 10600,
            "tsumo": 3600
        },
        "3": {
            "ron": 12000,
            "tsumo": 4000
        },
        "4": {
            "ron": 12000,
            "tsumo": 4000
        }
    }
};

export const manganTableKo: ManganTableKo = {
    5: {
        ron: 8000,
        tsumo: [2000, 4000]
    },
    6: {
        ron: 12000,
        tsumo: [3000, 6000]
    },
    7: {
        ron: 12000,
        tsumo: [3000, 6000]
    },
    8: {
        ron: 16000,
        tsumo: [4000, 8000]
    },
    9: {
        ron: 16000,
        tsumo: [4000, 8000]
    },
    10: {
        ron: 16000,
        tsumo: [4000, 8000]
    },
    11: {
        ron: 24000,
        tsumo: [6000, 12000]
    },
    12: {
        ron: 24000,
        tsumo: [6000, 12000]
    },
    13: {
        ron: 32000,
        tsumo: [8000, 16000]
    }
};

export const manganTableOya: ManganTableOya = {
    5: {
        ron: 12000,
        tsumo: 4000
    },
    6: {
        ron: 18000,
        tsumo: 6000
    },
    7: {
        ron: 18000,
        tsumo: 6000
    },
    8: {
        ron: 24000,
        tsumo: 8000
    },
    9: {
        ron: 24000,
        tsumo: 8000
    },
    10: {
        ron: 24000,
        tsumo: 8000
    },
    11: {
        ron: 36000,
        tsumo: 12000
    },
    12: {
        ron: 36000,
        tsumo: 12000
    },
    13: {
        ron: 48000,
        tsumo: 16000
    }
};